Repository: decoder-dev/decoder-sec
Catalog: DecoderSec/Localizable.xcstrings
Source language: en
Languages: ru, zh_hans

source: %@ configurations
ru: Конфигурации %@
zh_hans: %@ 配置

source: %@ is running
ru: %@ запущен
zh_hans: %@ 正在运行

source: About
ru: О приложении
zh_hans: 关于

source: Acknowledgements
ru: Благодарности
zh_hans: 致谢

source: Address
ru: Адрес
zh_hans: 地址

source: Always On
ru: Всегда включён
zh_hans: 始终开启

source: Cancel
ru: Отмена
zh_hans: 取消

source: Configurations
ru: Конфигурации
zh_hans: 配置

source: Connected
ru: Подключено
zh_hans: 已连接

source: Connecting
ru: Подключение…
zh_hans: 正在连接

source: Connection failed
ru: Ошибка подключения
zh_hans: 连接失败

source: Core Tutorial
ru: Справка по ядру
zh_hans: 核心教程

source: Delete
ru: Удалить
zh_hans: 删除

source: Delete %@
ru: Удалить %@
zh_hans: 删除 %@

source: Delete configuration?
ru: Удалить конфигурацию?
zh_hans: 删除配置？

source: Disconnected
ru: Отключено
zh_hans: 未连接

source: Disconnecting
ru: Отключение…
zh_hans: 正在断开连接

source: DNS Servers
ru: DNS-серверы
zh_hans: DNS 服务器

source: Enter a name for the new configuration.
ru: Введите имя новой конфигурации.
zh_hans: 输入新配置的名称。

source: Enter a name for the new folder.
ru: Введите имя новой папки.
zh_hans: 输入新文件夹的名称。

source: Enter a subscription URL.
ru: Введите URL подписки.
zh_hans: 输入订阅 URL。

source: Folder is not empty.
ru: Папка не пуста.
zh_hans: 文件夹不为空。

source: Go Back
ru: Назад
zh_hans: 返回

source: Home
ru: Главная
zh_hans: 主页

source: Import error
ru: Ошибка импорта
zh_hans: 导入错误

source: Import Files
ru: Импорт файлов
zh_hans: 导入文件

source: Import from file
ru: Импорт из файла
zh_hans: 从文件导入

source: Imported Configuration
ru: Импортированная конфигурация
zh_hans: 导入的配置

source: Invalid name.
ru: Некорректное имя.
zh_hans: 无效名称。

source: Join Telegram Group
ru: Telegram-группа
zh_hans: 加入 Telegram 群组

source: Loading
ru: Загрузка…
zh_hans: 加载中

source: Local
ru: Локально
zh_hans: 本地

source: More
ru: Ещё
zh_hans: 更多

source: Name
ru: Имя
zh_hans: 名称

source: Network
ru: Сеть
zh_hans: 网络

source: New
ru: Новая
zh_hans: 新建

source: New %@ configuration
ru: Новая конфигурация %@
zh_hans: 新 %@ 配置

source: New Folder
ru: Новая папка
zh_hans: 新文件夹

source: No items
ru: Пусто
zh_hans: 无项目

source: Not Configured
ru: Не настроено
zh_hans: 未配置

source: Reconnecting
ru: Переподключение…
zh_hans: 正在重新连接

source: Rename
ru: Переименовать
zh_hans: 重新命名

source: Rename configuration
ru: Переименовать конфигурацию
zh_hans: 重新命名配置

source: Repository
ru: Репозиторий
zh_hans: 仓库

source: Reset to default
ru: Сбросить по умолчанию
zh_hans: 恢复默认

source: Resources
ru: Ресурсы
zh_hans: 资源

source: Resources error
ru: Ошибка ресурсов
zh_hans: 资源错误

source: Save
ru: Сохранить
zh_hans: 保存

source: Settings
ru: Настройки
zh_hans: 设置

source: Show Dashboard
ru: Панель
zh_hans: 显示仪表盘

source: Stop the tunnel before switching cores.
ru: Сначала остановите туннель, чтобы сменить ядро.
zh_hans: 停止隧道以切换核心。

source: Stop the tunnel before switching the active configuration or deleting the active one.
ru: Сначала остановите туннель, чтобы сменить или удалить активную конфигурацию.
zh_hans: 停止核心以切换活跃配置或删除活跃配置。

source: Stop VPN
ru: Стоп VPN
zh_hans: 停止 VPN

source: Subscribe
ru: Подписка
zh_hans: 订阅

source: Subscribe to %@ configuration
ru: Подписка %@
zh_hans: 订阅 %@ 配置

source: Tunnel
ru: Туннель

source: Tunnel is running
ru: Туннель запущен
zh_hans: 隧道正在运行

source: Unknown
ru: Неизвестно
zh_hans: 未知

source: Update
ru: Обновить
zh_hans: 更新

source: Use zashboard
ru: Панель zashboard
zh_hans: 使用 zashboard

source: Connect
ru: Подключить

source: Disconnect
ru: Отключить

source: Configuration
ru: Конфигурация

source: Dashboard
ru: Панель

source: Storage unavailable
ru: Хранилище недоступно

source: Invalid encrypted Happ link.
ru: Некорректная зашифрованная ссылка Happ.

source: Encrypted-link keys are missing from the app bundle.
ru: Ключи для расшифровки ссылок отсутствуют в приложении.

source: Unknown crypt5 marker: %@
ru: Неизвестный маркер crypt5: %@

source: Could not decrypt Happ link: %@
ru: Не удалось расшифровать ссылку Happ: %@

source: RSA decryption failed.
ru: Ошибка расшифровки RSA.

source: ChaCha20 decryption failed.
ru: Ошибка расшифровки ChaCha20.

source: Unsupported deep link.
ru: Неподдерживаемая deep link-ссылка.

source: Routing disabled.
ru: Маршрутизация отключена.

source: VPN is connected.
ru: VPN подключён.

source: VPN is disconnected.
ru: VPN отключён.

source: Local storage is unavailable — can't save the imported subscription.
ru: Локальное хранилище недоступно — нельзя сохранить импортированную подписку.

source: Happ routing
ru: Маршрутизация Happ

source: When enabled, the active Happ routing profile is merged into Xray configs on import/connect. Deep links: happ://routing/onadd/… and happ://routing/off.
ru: Активный Happ routing-профиль добавляется в Xray при импорте/подключении. Deep links: happ://routing/onadd/… и happ://routing/off.

source: No profiles yet. Open a happ://routing/onadd/… link.
ru: Профилей пока нет. Откройте ссылку happ://routing/onadd/…

source: None
ru: Нет

source: Private tunnels. Your rules.
ru: Приватные туннели. Ваши правила.

source: Subscription “%@” imported.
ru: Подписка «%@» импортирована.

source: Subscription “%@” imported (+%@ more).
ru: Подписка «%@» импортирована (+%@ ещё).

source: Node “%@” imported.
ru: Узел «%@» импортирован.

source: Routing “%@” activated.
ru: Маршрутизация «%@» активирована.

source: Routing “%@” added.
ru: Маршрутизация «%@» добавлена.

source: Routing “%@” loaded from URL.
ru: Маршрутизация «%@» загружена по URL.

source: Server returned HTTP %lld.
ru: Сервер вернул HTTP %lld.

source: Response is not valid UTF-8 text.
ru: Ответ не является текстом в UTF-8.

source: Unrecognized subscription body.
ru: Неизвестный формат тела подписки.

source: JSON encode failed.
ru: Не удалось закодировать JSON.

source: This subscription requires a device ID (HWID). The panel rejected the request — ask your provider to allow this app, or import the config in Happ once so the device is registered.
ru: Эта подписка требует идентификатор устройства (HWID). Панель отклонила запрос — попросите провайдера разрешить это приложение или один раз импортируйте конфиг в Happ, чтобы устройство зарегистрировалось.

source: Provider returned “App not supported”. Send X-HWID (device id) is required — update the app, or ask the panel admin to allow this client.
ru: Провайдер вернул «App not supported». Нужен заголовок X-HWID (ID устройства) — обновите приложение или попросите админа панели разрешить этот клиент.

source: Subscription “%@” imported (+%lld more).
ru: Подписка «%@» импортирована (+%lld ещё).

source: Enter an https subscription URL or a happ://crypt… / share link.
ru: Вставьте https:// URL подписки или ссылку happ://crypt… / vless://…

source: https://… or happ://crypt5/…
ru: https://… или happ://crypt5/…

source: Paste a subscription URL, happ://crypt… link, or vless:// node.
ru: Вставьте URL подписки, ссылку happ://crypt… или vless:// узел.

source: Import
ru: Импорт

source: Unrecognized link. Use https://, happ://crypt…, or a share link.
ru: Неизвестная ссылка. Используйте https://, happ://crypt… или share-ссылку.

source: No active configuration
ru: Нет активной конфигурации

source: Import a Happ link or https subscription to connect.
ru: Импортируйте Happ-ссылку или https-подписку, чтобы подключиться.

source: Add subscription
ru: Добавить подписку

source: Browse configurations
ru: К конфигурациям

source: No configurations
ru: Нет конфигураций

source: Create one, import a file, or add a subscription.
ru: Создайте, импортируйте файл или добавьте подписку.

source: Deep link error
ru: Ошибка deep link

source: Handling deep link…
ru: Обработка deep link…

source: Version
ru: Версия

source: Running
ru: Работает

source: Refresh subscriptions
ru: Обновить подписки

source: Some subscriptions failed to refresh (%lld).
ru: Некоторые подписки не удалось обновить (%lld).

source: Some subscriptions failed to refresh (%@).
ru: Некоторые подписки не удалось обновить (%@).

source: Diagnostics
ru: Диагностика
zh_hans: 诊断

source: Re-apply Happ routing to active Xray
ru: Повторно применить Happ routing к активному Xray

source: Reconnect VPN
ru: Переподключить VPN

source: Routing
ru: Маршрутизация

source: Xray config
ru: Конфиг Xray

source: Actions
ru: Действия

source: Result
ru: Результат

source: VPN status
ru: Статус VPN

source: Core running
ru: Ядро запущено

source: Last error
ru: Последняя ошибка

source: Routing enabled
ru: Routing включён

source: Active routing profile
ru: Активный routing-профиль

source: Profiles count
ru: Количество профилей

source: Active Xray config
ru: Активный конфиг Xray

source: Outbound tags
ru: Теги outbound

source: Resolved proxy tag
ru: Выбранный proxy tag

source: Routing rules
ru: Правила routing

source: Has catch-all
ru: Есть catch-all

source: Has balancer
ru: Есть balancer

source: DNS servers
ru: DNS-серверы

source: No active Xray configuration.
ru: Нет активной Xray-конфигурации.

source: Routing is disabled or no active routing profile.
ru: Routing выключен или нет активного routing-профиля.

source: Routing apply failed: %@
ru: Ошибка применения routing: %@

source: Connected (core failed)
ru: Подключено (ядро не запущено)
zh_hans: 已连接（核心未运行）

source: Geo rules were stripped — routing may differ from Happ.
ru: Geo-правила удалены — маршрутизация может отличаться от Happ.
zh_hans: 已剥离 Geo 规则 — 路由可能与 Happ 不同。

source: Servers
ru: Серверы
zh_hans: 服务器

source: %lld servers
ru: %lld серверов
zh_hans: %lld 个服务器

source: Device
ru: Устройство
zh_hans: 设备

source: Device ID (HWID)
ru: ID устройства (HWID)
zh_hans: 设备 ID (HWID)

source: Copy device ID
ru: Скопировать ID
zh_hans: 复制设备 ID

source: Copied
ru: Скопировано
zh_hans: 已复制

source: Sent with every subscription request. Share this ID with your provider if you see HWID or “App not supported” errors.
ru: Отправляется с каждым запросом подписки. Передайте этот ID провайдеру при ошибках HWID или «App not supported».
zh_hans: 每次订阅请求都会发送。如出现 HWID 或“App not supported”错误，请将此 ID 提供给服务商。

source: yes
ru: да
zh_hans: 是

source: no
ru: нет
zh_hans: 否

source: none
ru: нет
zh_hans: 无

source: present
ru: есть
zh_hans: 已存在

source: not required
ru: не требуется
zh_hans: 不需要

source: missing (auto-download on connect)
ru: отсутствует (скачается при подключении)
zh_hans: 缺失（连接时自动下载）

source: Geo resources
ru: Geo-файлы

source: Needs geoip.dat
ru: Нужен geoip.dat

source: Needs geosite.dat
ru: Нужен geosite.dat

source: Geo rules stripped
ru: Geo-правила удалены

source: Extension resources path
ru: Путь к ресурсам extension

source: Resources path error
ru: Ошибка пути к ресурсам

source: Uses geosite/geoip
ru: Использует geosite/geoip

source: Refresh core status
ru: Обновить статус ядра

source: Requested tunnel diagnostics.
ru: Запрошена диагностика туннеля.

source: Routing re-applied to %@.
ru: Routing повторно применён к %@.

source: connected
ru: подключено

source: connecting
ru: подключение

source: disconnecting
ru: отключение

source: disconnected
ru: отключено

source: reasserting
ru: переподключение

source: invalid
ru: недействителен

source: unknown
ru: неизвестно

source: Enable Happ routing
ru: Включить Happ routing
zh_hans: 启用 Happ 路由

source: Profiles
ru: Профили
zh_hans: 配置文件

source: APNs toggle requires iOS 17+.
ru: Переключатель APNs доступен с iOS 17+.
zh_hans: APNs 开关需要 iOS 17+。

source: Log console
ru: Консоль логов
zh_hans: 日志控制台

source: No logs yet
ru: Логов пока нет
zh_hans: 暂无日志

source: Connect once to capture tunnel lifecycle events.
ru: Подключитесь один раз, чтобы записать события туннеля.
zh_hans: 连接一次以捕获隧道生命周期事件。

source: Auto-refresh
ru: Автообновление
zh_hans: 自动刷新

source: Refresh
ru: Обновить
zh_hans: 刷新

source: Clear
ru: Очистить
zh_hans: 清除

source: Copy all
ru: Копировать всё
zh_hans: 全部复制

source: Session
ru: Сессия
zh_hans: 会话

source: ↓ Down
ru: ↓ Вниз
zh_hans: ↓ 下载

source: ↑ Up
ru: ↑ Вверх
zh_hans: ↑ 上传

source: Traffic
ru: Трафик
zh_hans: 流量

source: unavailable
ru: недоступно
zh_hans: 不可用

source: OK
zh_hans: 好
